# coding:utf-8

str = "1234567"
print( str[0:5:] )# 左闭右开区间,元素下标 从min到max-1（右边是指中间位置）
print( str[2:10:] )# 右边超出可当作len值
print( str[::])# 原串
print( str[6::])# 左边若是超过len-1则为空串，右边不写默认 len
print(str[2]," ",str[-2])# 单个点索引不可超出范围[0,len)或[0,len-1]
print( str[-2::])# 左边为负数-则表示从倒数第i个数开始往右
print( str[:-2:])# 左边不写默认为0，右边为负数-截取至i-1（即：依旧是左闭右开）
print( str[2:-2:])# 345
print( str[-4:-2:])# 45
print( str[::-1])# 反序字串,相邻索引值差为1
print( str[::-2])# 反序字串，按照相邻索引值差为2截取部分
print( str[::-4])# 反序字串# 反序字串，按照相邻索引值差为4截取部分
print( str[3::-1])# 4321 逆序，索引i在左、正数，取str[i]左侧、含str[i]
print('========================')
print( str[:3:-1])# 765 逆序，索引i在右、正数，取str[i]右侧、不含str[i]
print('========================')
print( str[:-3:-1])# 76 逆序，索引i在右、负数，取str[len-i]右侧、不含str[len-i]
print( str[-3::-1])# 54321 逆序，索引i在右、负数，取str[len-i]左侧、含str[len-i]
print( str[-2:-4:-1])# 65
print('========================')
print( str[-2:2:-1])# 654
print('========================')
print( str[-2:3:-1])
